{
  "architectures": [
    "RobertaForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "type_vocab_size": 1,
  "vocab_size": 50265,
  "fusion_type": "residual",
  "graph": {
    "encoder": "GAT",
    "structured_layers": null,
    "data_flow": "c2h",
    "use_output_layer": false,
    "use_ff_layer": false,
    "use_data_flow_gate": false,
    "data_flow_gate": "HighwayGateLayer",
    "attention_probs_dropout_prob": 0.1,
    "num_rel_labels": 50,
    "do_pal_project": false,
    "lowrank_size": 256,
    "num_attention_heads": 12,
    "num_layers": 3,
    "use_self_weight": true,
    "use_task_aggregation": true,
    "use_fusion_gate": false,
    "fusion_gate": "ConstantGateLayer",
    "fusion_gate_const": 0.2,
    "use_rel_embedding": false,
    "rel_embed_size": 64,
    "num_basic_matrix": 10
  }
}